import React from "react";

export const FooterRules = () => {
  // TODO добавить в стили - отступы для <p>
  return (
    <div className="footer__copyright">
      <p>
        Пользователь сайта Woman.ru понимает и принимает, что он несет полную
        ответственность за все материалы, частично или полностью опубликованные
        с помощью сервиса Woman.ru. Пользователь сайта Woman.ru гарантирует, что
        размещение представленных им материалов не нарушает права третьих лиц
        (включая, но не ограничиваясь авторскими правами), не наносит ущерба их
        чести и достоинству.
      </p>
      <p>
        Пользователь сайта Woman.ru, отправляя материалы, тем самым
        заинтересован в их публикации на сайте и выражает свое согласие на их
        дальнейшее использование владельцами сайта Woman.ru. Все материалы сайта
        Woman.ru, независимо от формы и даты размещения на сайте, могут быть
        использованы только с согласия владельцев сайта.
      </p>
      <p>
        Использование и перепечатка печатных материалов сайта woman.ru возможно
        только с активной ссылкой на ресурс. Использование фотоматериалов
        разрешено только с письменного согласия администрации сайта.
      </p>
      <p>
        Размещение объектов интеллектуальной собственности (фото, видео,
        литературные произведения, товарные знаки и т.д.) на сайте woman.ru
        разрешено только лицам, имеющим все необходимые права для такого
        размещения.
      </p>
      <p>Copyright (с) 2016-2021 ООО «Хёрст Шкулёв Паблишинг»</p>
    </div>
  );
};

export default FooterRules;
